lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
#include <stddef.h>
#include <stdbool.h>
#include <stdint.h>

#include "nrf54l15_vpr_transport_shared.h"
#include "vpr_cs_ll_control.h"

#ifndef VPR_CS_DEDICATED_IMAGE
#define VPR_CS_DEDICATED_IMAGE 0
#endif

#define VPRCSR_NORDIC_VPRNORDICCTRL 0x7C0U
#define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL 0x7C1U
#define VPRCSR_NORDIC_TASKS 0x7E0U
#define VPRCSR_NORDIC_EVENTS 0x7E2U
#define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLERTPERIPH_Msk (1UL << 0U)
#define VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Pos 16U
#define VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Enabled 0x507DUL
#define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_SLEEPSTATE_HIBERNATE 0xFU
#define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_STACKONSLEEP_Msk (1UL << 17U)

#define BLE_CS_MAIN_MODE1 0x01U
#define BLE_CS_MAIN_MODE2 0x02U

#define BLE_CS_HCI_OP_READ_REMOTE_SUPPORTED_CAPABILITIES 0x208AU
#define BLE_CS_HCI_OP_WRITE_CACHED_REMOTE_SUPPORTED_CAPABILITIES 0x208BU
#define BLE_CS_HCI_OP_SECURITY_ENABLE 0x208CU
#define BLE_CS_HCI_OP_SET_DEFAULT_SETTINGS 0x208DU
#define BLE_CS_HCI_OP_READ_REMOTE_FAE_TABLE 0x208EU
#define BLE_CS_HCI_OP_WRITE_CACHED_REMOTE_FAE_TABLE 0x208FU
#define BLE_CS_HCI_OP_CREATE_CONFIG 0x2090U
#define BLE_CS_HCI_OP_REMOVE_CONFIG 0x2091U
#define BLE_CS_HCI_OP_SET_CHANNEL_CLASSIFICATION 0x2092U
#define BLE_CS_HCI_OP_SET_PROCEDURE_PARAMETERS 0x2093U
#define BLE_CS_HCI_OP_PROCEDURE_ENABLE 0x2094U
#define BLE_CS_HCI_OP_TEST 0x2095U
#define BLE_CS_HCI_OP_TEST_END 0x2096U
#define BLE_CS_HCI_OP_WRITE_CACHED_REMOTE_SUPPORTED_CAPABILITIES_V2 0x20A6U
#define BLE_CS_TEST_SUPPORTED_OVERRIDE_MASK 0x05FDU
#define BLE_CS_FAE_TABLE_LEN 72U
#define BLE_CS_CHANNEL_CLASSIFICATION_LEN 10U
#define BLE_CS_MAX_CONFIG_SLOTS 8U
#define BLE_CS_MAX_TRACKED_CONFIG_IDS (BLE_CS_MAX_CONFIG_SLOTS + 1U)
#define VPR_HCI_OP_VENDOR_BLE_CS_PEER_PDU_INJECT 0xFCE8U
#define VPR_HCI_OP_VENDOR_BLE_CS_PEER_STAGE_READ 0xFCE9U
#define VPR_HCI_OP_VENDOR_BLE_CS_PENDING_LOCAL_PDU_READ 0xFCEAU
#define VPR_HCI_OP_VENDOR_BLE_CS_SCHEDULER_READ 0xFCEBU
#define VPR_HCI_OP_VENDOR_BLE_CS_MEASUREMENT_WORK_READ 0xFCECU
#if !VPR_CS_DEDICATED_IMAGE
#define VPR_HCI_OP_VENDOR_PING 0xFCF0U
#define VPR_HCI_OP_VENDOR_GET_TRANSPORT_INFO 0xFCF1U
#define VPR_HCI_OP_VENDOR_FNV1A32 0xFCF2U
#define VPR_HCI_OP_VENDOR_GET_CAPABILITIES 0xFCF3U
#define VPR_HCI_OP_VENDOR_CRC32 0xFCF4U
#define VPR_HCI_OP_VENDOR_CRC32C 0xFCF5U
#define VPR_HCI_OP_VENDOR_TICKER_CONFIGURE 0xFCF6U
#define VPR_HCI_OP_VENDOR_TICKER_READ_STATE 0xFCF7U
#define VPR_HCI_OP_VENDOR_ENTER_HIBERNATE 0xFCF8U
#define VPR_HCI_OP_VENDOR_TICKER_EVENT_CONFIGURE 0xFCF9U
#define VPR_HCI_OP_VENDOR_BLE_LEGACY_ADV_CONFIGURE 0xFCFAU
#define VPR_HCI_OP_VENDOR_BLE_LEGACY_ADV_READ_STATE 0xFCFBU
#define VPR_HCI_OP_VENDOR_BLE_LEGACY_ADV_WRITE_DATA 0xFCFCU
#define VPR_HCI_OP_VENDOR_BLE_LEGACY_ADV_READ_DATA 0xFCFDU
#define VPR_HCI_OP_VENDOR_BLE_CONNECTION_CONFIGURE 0xFCE0U
#define VPR_HCI_OP_VENDOR_BLE_CONNECTION_READ_STATE 0xFCE1U
#define VPR_HCI_OP_VENDOR_BLE_CONNECTION_DISCONNECT 0xFCE2U
#define VPR_HCI_OP_VENDOR_BLE_CS_LINK_CONFIGURE 0xFCE3U
#define VPR_HCI_OP_VENDOR_BLE_CS_LINK_READ_STATE 0xFCE4U
#define VPR_HCI_OP_VENDOR_BLE_CS_WORKFLOW_CONFIGURE 0xFCE5U
#define VPR_HCI_OP_VENDOR_BLE_CS_WORKFLOW_READ_STATE 0xFCE6U
#define VPR_HCI_OP_VENDOR_BLE_CS_WORKFLOW_READ_COMPLETED_RESULT 0xFCE7U

#define VPR_VENDOR_SERVICE_VERSION_MAJOR 1U
#define VPR_VENDOR_SERVICE_VERSION_MINOR 16U
#define VPR_VENDOR_OP_PING (1UL << 0U)
#define VPR_VENDOR_OP_INFO (1UL << 1U)
#define VPR_VENDOR_OP_FNV1A32 (1UL << 2U)
#define VPR_VENDOR_OP_CAPABILITIES (1UL << 3U)
#define VPR_VENDOR_OP_CRC32 (1UL << 4U)
#define VPR_VENDOR_OP_CRC32C (1UL << 5U)
#define VPR_VENDOR_OP_TICKER_CONFIGURE (1UL << 6U)
#define VPR_VENDOR_OP_TICKER_READ_STATE (1UL << 7U)
#define VPR_VENDOR_OP_ENTER_HIBERNATE (1UL << 8U)
#define VPR_VENDOR_OP_TICKER_EVENT_CONFIGURE (1UL << 9U)
#define VPR_VENDOR_OP_BLE_LEGACY_ADV_CONFIGURE (1UL << 10U)
#define VPR_VENDOR_OP_BLE_LEGACY_ADV_READ_STATE (1UL << 11U)
#define VPR_VENDOR_OP_BLE_LEGACY_ADV_EVENT (1UL << 12U)
#define VPR_VENDOR_OP_BLE_LEGACY_ADV_WRITE_DATA (1UL << 13U)
#define VPR_VENDOR_OP_BLE_LEGACY_ADV_READ_DATA (1UL << 14U)
#define VPR_VENDOR_OP_BLE_CONNECTION_CONFIGURE (1UL << 15U)
#define VPR_VENDOR_OP_BLE_CONNECTION_READ_STATE (1UL << 16U)
#define VPR_VENDOR_OP_BLE_CONNECTION_EVENT (1UL << 17U)
#define VPR_VENDOR_OP_BLE_CS_LINK_CONFIGURE (1UL << 18U)
#define VPR_VENDOR_OP_BLE_CS_LINK_READ_STATE (1UL << 19U)
#define VPR_VENDOR_OP_BLE_CS_WORKFLOW_CONFIGURE (1UL << 20U)
#define VPR_VENDOR_OP_BLE_CS_WORKFLOW_READ_STATE (1UL << 21U)
#define VPR_VENDOR_OP_BLE_CS_WORKFLOW_READ_COMPLETED_RESULT (1UL << 22U)
#define VPR_VENDOR_TRANSPORT_FLAG_RESTORED_FROM_HIBERNATE 0x80U
#define VPR_VENDOR_EVENT_TICKER 0xA0U
#define VPR_VENDOR_EVENT_BLE_LEGACY_ADV 0xA1U
#define VPR_VENDOR_EVENT_BLE_CONNECTION 0xA2U
#endif
#define VPR_VENDOR_EVENT_CS_PEER_RESULT_TRIGGER 0xB1U
#define VPR_VENDOR_EVENT_CS_PEER_RESULT_SOURCE 0xB2U
#if !VPR_CS_DEDICATED_IMAGE
#define VPR_TICKER_EVENT_QUEUE_DEPTH 8U
#define VPR_BLE_LEGACY_ADV_EVENT_QUEUE_DEPTH 8U
#define VPR_BLE_CONNECTION_EVENT_QUEUE_DEPTH 8U
#define VPR_BLE_CS_COMPLETED_RESULT_MAX_LEN 160U
#endif

#define BLE_CS_HCI_EVT_READ_REMOTE_SUPPORTED_CAPS_COMPLETE_V2 0x38U
#define BLE_CS_HCI_EVT_READ_REMOTE_FAE_TABLE_COMPLETE 0x2DU
#define BLE_CS_HCI_EVT_SECURITY_ENABLE_COMPLETE 0x2EU
#define BLE_CS_HCI_EVT_CONFIG_COMPLETE 0x2FU
#define BLE_CS_HCI_EVT_PROCEDURE_ENABLE_COMPLETE 0x30U
#define BLE_CS_HCI_EVT_SUBEVENT_RESULT 0x31U
#define BLE_CS_HCI_EVT_SUBEVENT_RESULT_CONTINUE 0x32U
#define BLE_CS_HCI_EVT_TEST_END_COMPLETE 0x33U

/* CS Test mode emits standalone subevent results on this reserved handle
 * (Zephyr BT_HCI_LE_CS_TEST_CONN_HANDLE). config_id and the ACL event
 * counter are forced to 0 for test results per the host cs.c handling. */
#define BLE_CS_HCI_TEST_CONN_HANDLE 0x0FFFU
#define BLE_CS_HCI_TEST_CONFIG_ID 0x00U
#define BLE_CS_HCI_TEST_PROCEDURE_INTERVAL_TICKS 200U
#define BLE_CS_HCI_TEST_CHUNK_DELAY_TICKS 8U
#define BLE_CS_PEER_CONFIG_TIMEOUT_TICKS 500000U
#define BLE_CS_PEER_PROC_TIMEOUT_TICKS 500000U
#define BLE_CS_PEER_START_TIMEOUT_SCALE 8000U

#define BLE_HCI_PACKET_TYPE_COMMAND 0x01U
#define BLE_HCI_PACKET_TYPE_EVENT 0x04U
#define BLE_HCI_EVT_COMMAND_COMPLETE 0x0EU
#define BLE_HCI_EVT_COMMAND_STATUS 0x0FU
#define BLE_HCI_EVT_LE_META 0x3EU
#define BLE_HCI_EVT_VENDOR 0xFFU

extern uint8_t __stack_top[];

static volatile Nrf54l15VprTransportHostShared* const g_host_transport =
    (volatile Nrf54l15VprTransportHostShared*)(uintptr_t)NRF54L15_VPR_TRANSPORT_HOST_BASE;
static volatile Nrf54l15VprTransportVprShared* const g_vpr_transport =
    (volatile Nrf54l15VprTransportVprShared*)(uintptr_t)NRF54L15_VPR_TRANSPORT_VPR_BASE;

