lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static uint8_t current_demo_num_antenna_paths(void);
static size_t current_demo_total_encoded_step_bytes(void);
static size_t append_local_demo_step(uint8_t *dst, const uint8_t *channels,
                                     uint8_t step_index);

static uint8_t current_demo_step_count(void) {
  uint8_t min_steps = (g_cs_min_main_mode_steps != 0U) ? g_cs_min_main_mode_steps : 1U;
  uint8_t max_steps = (g_cs_max_main_mode_steps >= min_steps) ? g_cs_max_main_mode_steps
                                                              : min_steps;
  uint8_t count = min_steps;
  if (max_steps > min_steps) {
    const uint8_t span = (uint8_t)(max_steps - min_steps + 1U);
    count = (uint8_t)(min_steps + (current_step_count_group() % span));
  }
  if (count > 6U) {
    count = 6U;
  }
  return count;
}

static bool current_demo_has_mode1_timing_step(void) {
  return (g_cs_rtt_type != 0U) && (current_demo_step_count() > 3U);
}

static uint8_t current_demo_total_step_count(void) {
  return (uint8_t)(current_demo_step_count() + (current_demo_has_mode1_timing_step() ? 1U : 0U));
}

static size_t current_demo_subevent_policy_budget_bytes(void) {
#if VPR_CS_DEDICATED_IMAGE
  if (g_cs_max_subevent_len <= 0x000180UL) {
    return 24U;
  }
  if (g_cs_max_subevent_len <= 0x000300UL) {
    return 32U;
  }
  return 40U;
#else
  return 40U;
#endif
}

static uint8_t current_demo_subevent_count(void) {
#if VPR_CS_DEDICATED_IMAGE
  const uint8_t total_steps = current_demo_total_step_count();
  if (total_steps <= 6U) {
    return 1U;
  }
  const size_t total_bytes = current_demo_total_encoded_step_bytes();
  const size_t budget_bytes = current_demo_subevent_policy_budget_bytes();
  uint8_t count =
      (uint8_t)((total_bytes + budget_bytes - 1U) / budget_bytes);
  if (count < 2U) {
    count = 2U;
  }
  if (count > 3U) {
    count = 3U;
  }
  return count;
#else
  return 1U;
#endif
}

static uint8_t current_demo_subevent_start_step(uint8_t subevent_index) {
  const uint8_t total_steps = current_demo_total_step_count();
  const uint8_t subevent_count = current_demo_subevent_count();
  if (subevent_count <= 1U || subevent_index == 0U) {
    return 0U;
  }
  if (subevent_index >= subevent_count) {
    return total_steps;
  }

  uint8_t start = 0U;
  for (uint8_t i = 0U; i < subevent_index; ++i) {
    const uint8_t remaining_steps = (uint8_t)(total_steps - start);
    const uint8_t remaining_subevents = (uint8_t)(subevent_count - i);
    start = (uint8_t)(start +
                      ((uint8_t)((remaining_steps + remaining_subevents - 1U) /
                                 remaining_subevents)));
  }
  return start;
}

static uint8_t current_demo_subevent_step_count(uint8_t subevent_index) {
  const uint8_t total_steps = current_demo_total_step_count();
  const uint8_t start = current_demo_subevent_start_step(subevent_index);
  if (start >= total_steps) {
    return 0U;
  }
  const uint8_t next_start = current_demo_subevent_start_step((uint8_t)(subevent_index + 1U));
  return (next_start > start) ? (uint8_t)(next_start - start)
                              : (uint8_t)(total_steps - start);
}

static size_t current_demo_encoded_step_len(uint8_t step_index) {
  return (current_demo_has_mode1_timing_step() && step_index == 0U) ? 9U : 8U;
}

static size_t current_demo_total_encoded_step_bytes_for_range(uint8_t start_step_index,
                                                              uint8_t step_count) {
  size_t total = 0U;
  const uint8_t end_step_index = (uint8_t)(start_step_index + step_count);
  for (uint8_t step_index = start_step_index; step_index < end_step_index; ++step_index) {
    total += current_demo_encoded_step_len(step_index);
  }
  return total;
}

static size_t current_demo_total_encoded_step_bytes(void) {
  return current_demo_total_encoded_step_bytes_for_range(0U, current_demo_total_step_count());
}

static size_t current_demo_subevent_encoded_step_bytes(uint8_t subevent_index) {
  return current_demo_total_encoded_step_bytes_for_range(
      current_demo_subevent_start_step(subevent_index),
      current_demo_subevent_step_count(subevent_index));
}

static uint8_t current_demo_phase_step_index(uint8_t step_index) {
  return (uint8_t)(step_index - (current_demo_has_mode1_timing_step() ? 1U : 0U));
}

static size_t append_local_demo_step(uint8_t *dst, const uint8_t *channels, uint8_t step_index) {
  if (dst == NULL || channels == NULL) {
    return 0U;
  }
  if (current_demo_has_mode1_timing_step() && step_index == 0U) {
    return append_mode1_unavailable_step(dst, channels[0], current_demo_num_antenna_paths());
  }
  const uint8_t phase_step_index = current_demo_phase_step_index(step_index);
  append_mode2_demo_step(dst, channels[phase_step_index], phase_step_index);
  return 8U;
}

static size_t append_peer_demo_step(uint8_t *dst, const uint8_t *channels, uint8_t step_index) {
  if (dst == NULL || channels == NULL) {
    return 0U;
  }
  if (current_demo_has_mode1_timing_step() && step_index == 0U) {
    return append_mode1_unavailable_step(dst, channels[0], current_demo_num_antenna_paths());
  }
  const uint8_t phase_step_index = current_demo_phase_step_index(step_index);
  append_mode2_peer_demo_step(dst, channels[phase_step_index], phase_step_index);
  return 8U;
}

static uint8_t count_demo_steps_for_budget(size_t budget, uint8_t start_step_index,
                                           uint8_t end_step_index) {
  size_t used = 0U;
  uint8_t count = 0U;
  for (uint8_t step_index = start_step_index; step_index < end_step_index; ++step_index) {
    const size_t step_len = current_demo_encoded_step_len(step_index);
    if (used + step_len > budget) {
      break;
    }
    used += step_len;
    ++count;
  }
  return count;
}

static size_t current_demo_initial_chunk_budget(uint8_t subevent_index) {
#if VPR_CS_DEDICATED_IMAGE
  if (current_demo_subevent_encoded_step_bytes(subevent_index) > 32U) {
    if (g_cs_min_subevent_len <= 0x000180UL) {
      return 9U;
    }
    return 17U;
  }
#endif
  return 25U;
}

static size_t current_demo_continue_chunk_budget(uint8_t subevent_index,
                                                 uint8_t start_step_index) {
  (void)start_step_index;
#if VPR_CS_DEDICATED_IMAGE
  if (current_demo_subevent_encoded_step_bytes(subevent_index) > 32U) {
    if (g_cs_min_subevent_len <= 0x000180UL) {
      return 8U;
    }
    return 16U;
  }
#endif
  return 32U;
}

static uint16_t current_demo_acl_event_counter(void) {
  return (uint16_t)(0x1200U + (current_channel_selection_group() * 0x10U) +
                    current_step_count_group());
}

