lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static uint16_t current_demo_frequency_compensation(void) {
  return (uint16_t)(0x0010U + ((current_channel_selection_group() & 0x0FU) << 2U) +
                    (current_step_count_group() & 0x03U));
}

static int8_t current_demo_reference_power_dbm(void) {
  int16_t dbm = (int16_t)g_cs_max_tx_power_dbm + (int16_t)g_cs_tx_power_delta;
  if (dbm < -127) {
    dbm = -127;
  }
  if (dbm > 20) {
    dbm = 20;
  }
  return (int8_t)dbm;
}

static uint8_t current_demo_num_antenna_paths(void) {
  uint8_t count = g_cs_tone_antenna_config_selection;
  if (count == 0U) {
    count = 1U;
  }
  if (count > 4U) {
    count = 4U;
  }
  return count;
}

static uint32_t pack_demo_channels_from_map(const uint8_t *channel_map) {
  uint8_t channels[4];
  uint8_t found = 0U;
  uint8_t last = 2U;
  uint32_t packed = 0U;

  if (channel_map == NULL) {
    return 0U;
  }

  for (uint8_t bit = 0U; bit < 80U && found < 4U; ++bit) {
    if (channel_map_bit_enabled(channel_map, bit)) {
      last = bit;
      channels[found++] = bit;
    }
  }
  if (found == 0U) {
    return 0U;
  }
  for (uint8_t i = found; i < 4U; ++i) {
    channels[i] = last;
  }
  for (uint8_t i = 0U; i < 4U; ++i) {
    packed |= ((uint32_t)channels[i] << (8U * i));
  }
  return packed;
}

static vpr_cs_config_slot_t *find_cs_slot(uint8_t config_id) {
  for (uint8_t i = 0U; i < (uint8_t)(sizeof(g_cs_slots) / sizeof(g_cs_slots[0])); ++i) {
    if (g_cs_slots[i].inUse != 0U && g_cs_slots[i].configId == config_id) {
      return &g_cs_slots[i];
    }
  }
  if (g_cs_previous_slot.inUse != 0U && g_cs_previous_slot.configId == config_id) {
    return &g_cs_previous_slot;
  }
  return NULL;
}

static vpr_cs_config_slot_t *find_cs_primary_slot(uint8_t config_id) {
  for (uint8_t i = 0U; i < (uint8_t)(sizeof(g_cs_slots) / sizeof(g_cs_slots[0])); ++i) {
    if (g_cs_slots[i].inUse != 0U && g_cs_slots[i].configId == config_id) {
      return &g_cs_slots[i];
    }
  }
  return NULL;
}

static vpr_cs_config_slot_t *allocate_cs_slot(uint8_t config_id) {
  vpr_cs_config_slot_t *slot = find_cs_primary_slot(config_id);
  if (slot != NULL) {
    return slot;
  }
  for (uint8_t i = 0U; i < (uint8_t)(sizeof(g_cs_slots) / sizeof(g_cs_slots[0])); ++i) {
    if (g_cs_slots[i].inUse == 0U) {
      bytes_zero(&g_cs_slots[i], sizeof(g_cs_slots[i]));
      g_cs_slots[i].inUse = 1U;
      g_cs_slots[i].configId = config_id;
      return &g_cs_slots[i];
    }
  }
  return NULL;
}

static bool can_allocate_create_config_slot(uint8_t config_id) {
  if (find_cs_slot(config_id) != NULL) {
    return true;
  }
  if (has_free_cs_slot()) {
    return true;
  }
  return (g_cs_config_created != 0U) && (find_cs_primary_slot(g_cs_config_id) != NULL);
}

static vpr_cs_config_slot_t *allocate_create_config_slot(uint8_t config_id,
                                                         bool allow_previous_overflow) {
  vpr_cs_config_slot_t *slot = find_cs_slot(config_id);
  if (slot != NULL) {
    return slot;
  }
  slot = allocate_cs_slot(config_id);
  if (slot != NULL) {
    return slot;
  }
  if (!allow_previous_overflow) {
    return NULL;
  }
  if (g_cs_previous_slot.inUse != 0U && g_cs_previous_slot.configId != config_id) {
    g_cs_last_evicted_config_id = g_cs_previous_slot.configId;
  }
  clear_cs_slot(&g_cs_previous_slot);
  g_cs_previous_slot.inUse = 1U;
  g_cs_previous_slot.configId = config_id;
  return &g_cs_previous_slot;
}

static vpr_cs_config_slot_t *promote_previous_slot_to_primary(bool preserve_displaced) {
  vpr_cs_config_slot_t promoted;
  vpr_cs_config_slot_t displaced;
  vpr_cs_config_slot_t *target = NULL;
  bool have_displaced = false;

  if (g_cs_previous_slot.inUse == 0U || g_cs_previous_slot.configId == 0U) {
    return NULL;
  }

  bytes_zero(&promoted, sizeof(promoted));
  bytes_zero(&displaced, sizeof(displaced));
  bytes_copy(&promoted, &g_cs_previous_slot, sizeof(promoted));

  if (g_cs_config_created != 0U && g_cs_config_id != 0U) {
    target = find_cs_primary_slot(g_cs_config_id);
  }
  if (target == NULL) {
    for (uint8_t i = 0U; i < (uint8_t)(sizeof(g_cs_slots) / sizeof(g_cs_slots[0])); ++i) {
      if (g_cs_slots[i].inUse == 0U) {
        target = &g_cs_slots[i];
        break;
      }
    }
  }
  if (target == NULL) {
    target = &g_cs_slots[0];
  }

  if (target->inUse != 0U && target->configId != promoted.configId) {
    bytes_copy(&displaced, target, sizeof(displaced));
    have_displaced = true;
  }

  bytes_copy(target, &promoted, sizeof(promoted));
  target->inUse = 1U;

  if (preserve_displaced && have_displaced && displaced.configId != 0U) {
    bytes_copy(&g_cs_previous_slot, &displaced, sizeof(displaced));
  } else {
    clear_cs_slot(&g_cs_previous_slot);
  }

  return target;
}

static void clear_cs_slot(vpr_cs_config_slot_t *slot) {
  if (slot == NULL) {
    return;
  }
  bytes_zero(slot, sizeof(*slot));
}

static void clear_cs_slots_for_config(uint8_t config_id) {
  for (uint8_t i = 0U; i < (uint8_t)(sizeof(g_cs_slots) / sizeof(g_cs_slots[0])); ++i) {
    if (g_cs_slots[i].inUse != 0U && g_cs_slots[i].configId == config_id) {
      clear_cs_slot(&g_cs_slots[i]);
    }
  }
  if (g_cs_previous_slot.inUse != 0U && g_cs_previous_slot.configId == config_id) {
    clear_cs_slot(&g_cs_previous_slot);
  }
}

static bool any_cs_slot_in_use(void) {
  for (uint8_t i = 0U; i < (uint8_t)(sizeof(g_cs_slots) / sizeof(g_cs_slots[0])); ++i) {
    if (g_cs_slots[i].inUse != 0U) {
      return true;
    }
  }
  return g_cs_previous_slot.inUse != 0U;
}

static bool has_free_cs_slot(void) {
  for (uint8_t i = 0U; i < (uint8_t)(sizeof(g_cs_slots) / sizeof(g_cs_slots[0])); ++i) {
    if (g_cs_slots[i].inUse == 0U) {
      return true;
    }
  }
  return false;
}

static bool load_active_state_from_slot(const vpr_cs_config_slot_t *slot) {
  if (slot == NULL || slot->inUse == 0U) {
    return false;
  }

  g_cs_config_id = slot->configId;
  g_cs_demo_channels_packed = slot->demoChannelsPacked;
  g_cs_main_mode_type = slot->mainModeType;
  g_cs_sub_mode_type = slot->subModeType;
  g_cs_min_main_mode_steps = slot->minMainModeSteps;
  g_cs_max_main_mode_steps = slot->maxMainModeSteps;
  g_cs_main_mode_repetition = slot->mainModeRepetition;
  g_cs_mode0_steps = slot->mode0Steps;
  g_cs_role = slot->role;
  g_cs_rtt_type = slot->rttType;
  g_cs_cs_sync_phy = slot->csSyncPhy;
  bytes_copy(g_cs_channel_map, slot->channelMap, sizeof(g_cs_channel_map));
  g_cs_channel_map_repetition = slot->channelMapRepetition;
  g_cs_channel_selection_type = slot->channelSelectionType;
  g_cs_ch3c_shape = slot->ch3cShape;
  g_cs_ch3c_jump = slot->ch3cJump;
  g_cs_enhancements1 = slot->enhancements1;
  g_cs_max_procedure_len = slot->maxProcedureLen;
  g_cs_min_procedure_interval = slot->minProcedureInterval;
  g_cs_max_procedure_interval = slot->maxProcedureInterval;
  g_cs_max_procedure_count = slot->maxProcedureCount;
  g_cs_min_subevent_len = slot->minSubeventLen;
  g_cs_max_subevent_len = slot->maxSubeventLen;
  g_cs_tone_antenna_config_selection = slot->toneAntennaConfigSelection;
  g_cs_phy = slot->phy;
  g_cs_tx_power_delta = slot->txPowerDelta;
  g_cs_config_created = 1U;
  g_cs_security_enabled = slot->securityEnabled;
  g_cs_procedure_params_applied = slot->procedureParamsApplied;
  return true;
}

static void store_active_create_state(vpr_cs_config_slot_t *slot) {
  if (slot == NULL) {
    return;
  }
  slot->inUse = 1U;
  slot->configId = g_cs_config_id;
  slot->demoChannelsPacked = g_cs_demo_channels_packed;
  slot->mainModeType = g_cs_main_mode_type;
  slot->subModeType = g_cs_sub_mode_type;
  slot->minMainModeSteps = g_cs_min_main_mode_steps;
  slot->maxMainModeSteps = g_cs_max_main_mode_steps;
  slot->mainModeRepetition = g_cs_main_mode_repetition;
  slot->mode0Steps = g_cs_mode0_steps;
  slot->role = g_cs_role;
  slot->rttType = g_cs_rtt_type;
  slot->csSyncPhy = g_cs_cs_sync_phy;
  bytes_copy(slot->channelMap, g_cs_channel_map, sizeof(slot->channelMap));
  slot->channelMapRepetition = g_cs_channel_map_repetition;
  slot->channelSelectionType = g_cs_channel_selection_type;
  slot->ch3cShape = g_cs_ch3c_shape;
  slot->ch3cJump = g_cs_ch3c_jump;
  slot->enhancements1 = g_cs_enhancements1;
  slot->securityEnabled = g_cs_security_enabled;
  slot->procedureParamsApplied = g_cs_procedure_params_applied;
}

static void store_active_procedure_state(vpr_cs_config_slot_t *slot) {
  if (slot == NULL) {
    return;
  }
  slot->maxProcedureLen = g_cs_max_procedure_len;
  slot->minProcedureInterval = g_cs_min_procedure_interval;
  slot->maxProcedureInterval = g_cs_max_procedure_interval;
  slot->maxProcedureCount = g_cs_max_procedure_count;
  slot->minSubeventLen = g_cs_min_subevent_len;
  slot->maxSubeventLen = g_cs_max_subevent_len;
  slot->toneAntennaConfigSelection = g_cs_tone_antenna_config_selection;
  slot->phy = g_cs_phy;
  slot->txPowerDelta = g_cs_tx_power_delta;
  slot->securityEnabled = g_cs_security_enabled;
  slot->procedureParamsApplied = g_cs_procedure_params_applied;
}

static void preserve_active_state_to_slot(void) {
  vpr_cs_config_slot_t *slot = NULL;
  if (g_cs_session_open == 0U || g_cs_config_created == 0U || g_cs_config_id == 0U) {
    return;
  }
  slot = find_cs_primary_slot(g_cs_config_id);
  if (slot == NULL && g_cs_previous_slot.inUse != 0U &&
      g_cs_previous_slot.configId == g_cs_config_id) {
    slot = &g_cs_previous_slot;
  }
  if (slot == NULL) {
    slot = allocate_cs_slot(g_cs_config_id);
  }
  if (slot == NULL) {
    clear_cs_slot(&g_cs_previous_slot);
    g_cs_previous_slot.inUse = 1U;
    g_cs_previous_slot.configId = g_cs_config_id;
    slot = &g_cs_previous_slot;
  }
  store_active_create_state(slot);
  store_active_procedure_state(slot);
}

static bool activate_stored_config_slot(uint8_t config_id, bool preserve_current) {
  vpr_cs_config_slot_t *slot = NULL;
  if (config_id == 0U) {
    return false;
  }
  if (preserve_current && g_cs_config_created != 0U && g_cs_config_id != config_id) {
    preserve_active_state_to_slot();
  }
  slot = find_cs_slot(config_id);
  if (slot == NULL || !load_active_state_from_slot(slot)) {
    return false;
  }
  clear_active_runtime_state();
  return true;
}

static bool activate_first_stored_config_slot(void) {
  for (uint8_t i = 0U; i < (uint8_t)(sizeof(g_cs_slots) / sizeof(g_cs_slots[0])); ++i) {
    if (g_cs_slots[i].inUse != 0U &&
        activate_stored_config_slot(g_cs_slots[i].configId, false)) {
      return true;
    }
  }
  if (g_cs_previous_slot.inUse != 0U) {
    return activate_stored_config_slot(g_cs_previous_slot.configId, false);
  }
  return false;
}

static uint8_t fill_demo_channels_for_procedure(uint8_t *out_channels, uint8_t channel_count) {
  const uint32_t fallback_packed =
      (g_cs_demo_channels_packed != 0U) ? g_cs_demo_channels_packed : g_host_transport->reserved;
  uint8_t enabled[40];
  uint8_t count = 0U;
  uint8_t jump = 1U;
  uint8_t start = 0U;

  if (out_channels == NULL || channel_count == 0U) {
    return 0U;
  }

  for (uint8_t bit = 0U; bit < 40U; ++bit) {
    if (channel_map_bit_enabled(g_cs_channel_map, bit)) {
      enabled[count++] = bit;
    }
  }

  if (count == 0U) {
    for (uint8_t i = 0U; i < channel_count; ++i) {
      const uint8_t shift = (uint8_t)((i & 0x03U) * 8U);
      out_channels[i] = (uint8_t)((fallback_packed >> shift) & 0xFFU);
    }
    return channel_count;
  }

  if (g_cs_channel_selection_type == 1U && g_cs_ch3c_jump > 0U) {
    jump = g_cs_ch3c_jump;
  }
  start = (uint8_t)((current_channel_selection_group() * jump) % count);
  for (uint8_t i = 0U; i < channel_count; ++i) {
    out_channels[i] = enabled[(uint8_t)((start + i) % count)];
  }
  return channel_count;
}

