lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static size_t build_vendor_ble_legacy_adv_event_payload(
    uint8_t *payload, size_t max_len, const vpr_ble_legacy_adv_event_entry_t *event) {
  if (payload == NULL || event == NULL || max_len < 18U) {
    return 0U;
  }
  payload[0] = event->flags;
  payload[1] = event->channelMask;
  write_le32(&payload[2], event->eventCount);
  write_le32(&payload[6], event->heartbeat);
  write_le32(&payload[10], event->randomDelayTicks);
  write_le32(&payload[14], event->sequence);
  return 18U;
}

static size_t build_vendor_ble_connection_event_payload(
    uint8_t *payload, size_t max_len, const vpr_ble_connection_event_entry_t *event) {
  if (payload == NULL || event == NULL || max_len < 26U) {
    return 0U;
  }
  payload[0] = event->flags;
  write_le16(&payload[1], event->connHandle);
  payload[3] = event->reason;
  payload[4] = event->role;
  payload[5] = (uint8_t)(event->encrypted != 0U ? 1U : 0U);
  write_le16(&payload[6], event->intervalUnits);
  write_le16(&payload[8], event->latency);
  write_le16(&payload[10], event->supervisionTimeout);
  payload[12] = event->txPhy;
  payload[13] = event->rxPhy;
  write_le32(&payload[14], event->eventCount);
  write_le32(&payload[18], event->disconnectCount);
  write_le32(&payload[22], event->sequence);
  return 26U;
}

static size_t build_vendor_enter_hibernate_complete_payload(uint8_t *payload, size_t max_len) {
  if (payload == NULL || max_len < 5U) {
    return 0U;
  }
  payload[0] = 0U;
  write_le32(&payload[1], g_vpr_transport->heartbeat);
  persist_hibernate_state();
  g_pending_hibernate = 1U;
  return 5U;
}
#else
static uint16_t read_opcode(void) {
  if (g_host_transport->hostLen < 4U) {
    return 0U;
  }
  if (g_host_transport->hostData[0] != 0x01U) {
    return 0U;
  }
  return (uint16_t)g_host_transport->hostData[1] |
         ((uint16_t)g_host_transport->hostData[2] << 8U);
}
#endif

static void build_unknown_command_response(uint16_t opcode) {
  zero_vpr_data();
  g_vpr_transport->vprData[0] = 0x04U;
  g_vpr_transport->vprData[1] = 0x0EU;
  g_vpr_transport->vprData[2] = 4U;
  g_vpr_transport->vprData[3] = 1U;
  g_vpr_transport->vprData[4] = (uint8_t)(opcode & 0xFFU);
  g_vpr_transport->vprData[5] = (uint8_t)((opcode >> 8U) & 0xFFU);
  g_vpr_transport->vprData[6] = 0x01U;
  g_vpr_transport->vprLen = 7U;
}

static bool command_layout_is_exact(size_t payload_len) {
  return g_host_transport->hostLen == (4U + payload_len) &&
         g_host_transport->hostData[0] == 0x01U &&
         g_host_transport->hostData[3] == payload_len;
}

static uint8_t validate_conn_scoped_command(size_t payload_len) {
  if (!command_layout_is_exact(payload_len)) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
#if VPR_CS_DEDICATED_IMAGE
  if (!command_conn_handle_matches_active_link()) {
    return (g_cs_session_open != 0U) ? BLE_CS_HCI_STATUS_INVALID_PARAMS
                                     : BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
#endif
  return BLE_CS_HCI_STATUS_SUCCESS;
}

static uint8_t validate_cs_test_command(void) {
  if (g_cs_test_active != 0U) {
    return BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  if (g_host_transport->hostLen < 34U ||
      g_host_transport->hostData[0] != 0x01U ||
      g_host_transport->hostData[3] != (g_host_transport->hostLen - 4U) ||
      g_host_transport->hostLen != (34U + g_host_transport->hostData[33])) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  return (read_le16(&g_host_transport->hostData[31]) &
          (uint16_t)~BLE_CS_TEST_SUPPORTED_OVERRIDE_MASK) == 0U
             ? BLE_CS_HCI_STATUS_SUCCESS
             : BLE_CS_HCI_STATUS_INVALID_PARAMS;
}

#if VPR_CS_DEDICATED_IMAGE
static size_t build_vendor_ble_cs_peer_exchange_payload(uint8_t *payload,
                                                        size_t max_len,
                                                        uint8_t status,
                                                        uint8_t previous_stage) {
  if (payload == NULL || max_len < 9U) {
    return 0U;
  }
  payload[0] = status;
  payload[1] = previous_stage;
  payload[2] = g_cs_peer_exchange_stage;
  write_le32(&payload[3], g_cs_peer_exchange_deadline);
  payload[7] = g_cs_procedure_abort_reason;
  payload[8] = g_cs_subevent_abort_reason;
  return 9U;
}

static size_t build_local_initiator_ll_control_pdu(uint8_t *payload,
                                                   size_t max_len) {
  if (payload == NULL) {
    return 0U;
  }

  switch (g_cs_peer_exchange_stage) {
    case VPR_CS_PEER_STAGE_AWAITING_CS_RSP: {
      if (max_len < VPR_CS_LL_REQ_RSP_PDU_LEN) {
        return 0U;
      }
      vpr_cs_ll_pdu_req_rsp_t pdu = {
          VPR_CS_LL_CS_REQ,
          VPR_CS_LL_REQ_RSP_PAYLOAD_LEN,
          1U,
          g_cs_config_id,
      };
      size_t out_len = 0U;
      return vpr_cs_ll_encode_pdu(&pdu, sizeof(pdu), payload, &out_len) ? out_len : 0U;
    }

    case VPR_CS_PEER_STAGE_AWAITING_SEC_RSP: {
      if (max_len < VPR_CS_LL_SEC_PDU_LEN) {
        return 0U;
      }
      vpr_cs_ll_pdu_sec_req_rsp_t pdu = {
          VPR_CS_LL_CS_SEC_REQ,
          VPR_CS_LL_SEC_PAYLOAD_LEN,
          g_cs_config_id,
      };
      size_t out_len = 0U;
      return vpr_cs_ll_encode_pdu(&pdu, sizeof(pdu), payload, &out_len) ? out_len : 0U;
    }

    case VPR_CS_PEER_STAGE_AWAITING_PROC_RSP: {
      if (max_len < VPR_CS_LL_PROC_PDU_LEN) {
        return 0U;
      }
      vpr_cs_ll_pdu_proc_req_rsp_t pdu = {
          VPR_CS_LL_CS_PROC_REQ,
          VPR_CS_LL_PROC_PAYLOAD_LEN,
          g_cs_config_id,
          {0},
      };
      write_le16(&pdu.params[0], g_cs_max_procedure_len);
      write_le16(&pdu.params[2], g_cs_min_procedure_interval);
      write_le16(&pdu.params[4], g_cs_max_procedure_interval);
      write_le16(&pdu.params[6], g_cs_max_procedure_count);
      write_le24(&pdu.params[8], g_cs_min_subevent_len);
      pdu.params[11] = (uint8_t)((g_cs_min_subevent_len >> 24U) & 0xFFU);
      write_le24(&pdu.params[12], g_cs_max_subevent_len);
      pdu.params[15] = (uint8_t)((g_cs_max_subevent_len >> 24U) & 0xFFU);
      pdu.params[16] = g_cs_phy;
      pdu.params[17] = (uint8_t)g_cs_tx_power_delta;
      size_t out_len = 0U;
      return vpr_cs_ll_encode_pdu(&pdu, sizeof(pdu), payload, &out_len) ? out_len : 0U;
    }

    default:
      return 0U;
  }
}

static size_t build_vendor_ble_cs_pending_local_pdu_complete_payload(uint8_t *payload,
                                                                    size_t max_len) {
  const uint8_t previous_stage = g_cs_peer_exchange_stage;
  uint8_t status = command_layout_is_exact(0U)
                       ? BLE_CS_HCI_STATUS_SUCCESS
                       : BLE_CS_HCI_STATUS_INVALID_PARAMS;
  size_t header_len = build_vendor_ble_cs_peer_exchange_payload(
      payload, max_len, status, previous_stage);
  if (header_len == 0U || max_len < (header_len + 1U)) {
    return 0U;
  }

  payload[header_len] = 0U;
  if (status != BLE_CS_HCI_STATUS_SUCCESS) {
    return header_len + 1U;
  }

  size_t pdu_len = build_local_initiator_ll_control_pdu(
      &payload[header_len + 1U], max_len - header_len - 1U);
  if (pdu_len == 0U) {
    return header_len + 1U;
  }

  payload[header_len] = (uint8_t)pdu_len;
  return header_len + 1U + pdu_len;
}

static uint8_t validate_peer_pdu_inject_command(size_t *out_pdu_len) {
  if (out_pdu_len == NULL) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  *out_pdu_len = 0U;
  if (g_host_transport->hostLen < 6U ||
      g_host_transport->hostData[0] != BLE_HCI_PACKET_TYPE_COMMAND ||
      g_host_transport->hostData[3] != (g_host_transport->hostLen - 4U)) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }

  const size_t pdu_len = g_host_transport->hostLen - 4U;
  vpr_cs_ll_pdu_header_t header;
  if (!vpr_cs_ll_decode_header((const uint8_t *)&g_host_transport->hostData[4],
                                pdu_len, &header) ||
      pdu_len != ((size_t)header.len + 2U)) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }

  *out_pdu_len = pdu_len;
  return BLE_CS_HCI_STATUS_SUCCESS;
}

